cmsis-svd/cmsis-svd/data/MindMotion/MM32W0xxxxB.svd
      </registers>
    </peripheral>
     <peripheral>
      <name>COMP</name>
      <description>comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40013c00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COMP1_CSR</name>
          <displayName>COMP1_CSR</displayName>
          <description>COMP1_CSR</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
          <field>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <name>LOCK</name>
            <description>Comparator lock</description>
          </field>
          <field>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <name>OUT</name>
            <description>Comparator 1 lock</description>
          </field>
          <field>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <name>HYST</name>
            <description>Comparator 1 hysteresis</description>
          </field>
          <field>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <name>POL</name>
            <description>Comparator 1 output polarity</description>
          </field>
          <field>
            <bitOffset>10</bitOffset>
            <bitWidth>3</bitWidth>
            <name>OUT_SEL</name>
            <description>Comparator 1 output selection</description>
          </field>
          <field>
            <bitOffset>7</bitOffset>
            <bitWidth>3</bitWidth>
            <name>INP_SEL</name>
            <description>Comparator 1 normal phase input selection</description>
          </field>
          <field>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <name>INM_SEL</name>
            <description>Comparator 1 inverting input selection</description>
          </field>
          <field>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <name>MODE</name>
            <description>Comparator 1 mode</description>
          </field>
          <field>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <name>EN</name>
            <description>Comparator 1 enable</description>
          </field>
        </fields>
        </register>
        <register>
          <name>COMP2_CSR</name>
          <displayName>COMP2_CSR</displayName>
          <description>COMP2_CSR</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
          <field>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <name>LOCK</name>
            <description>Comparator lock</description>
          </field>
          <field>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <name>OUT</name>
            <description>Comparator 2 lock</description>
          </field>
          <field>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <name>HYST</name>
            <description>Comparator 2 hysteresis</description>
          </field>
          <field>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <name>POL</name>
            <description>Comparator 2 output polarity</description>
          </field>
          <field>
            <bitOffset>10</bitOffset>
            <bitWidth>3</bitWidth>
            <name>OUT_SEL</name>
            <description>Comparator 2 output selection</description>
          </field>
          <field>
            <bitOffset>7</bitOffset>
            <bitWidth>3</bitWidth>
            <name>INP_SEL</name>
            <description>Comparator 2 normal phase input selection</description>
          </field>
          <field>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <name>INM_SEL</name>
            <description>Comparator 2 inverting input selection</description>
          </field>
          <field>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <name>MODE</name>
            <description>Comparator 2 mode</description>
          </field>
          <field>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <name>EN</name>
            <description>Comparator 2 enable</description>
          </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
